Command Reference

You can enter commands on the console after hitting the INS key. Commands are not case sensitive.

But even better: connect to the RS232C on the MPU board at 2400/N/8/1 with a null modem cable. If using a terminal, be sure to enable local echo and add line endings.

On the serial console, commands are acknowledged with the following codes:
	* !0: OK
	* !3: Bad command
	* !4: Command OK, but bad parameter supplied
	* !5: I can't let you do that, Dave. (eg. SD SEI when the beam is off)
	* !6: Command cancelled but it wasn't running (eg. PHL OFF with no PHL ON)

Beam parameters
	* Acceleration voltage get: ACC
	* Acceleration voltage set: ACC 10
	* Gun alignment get: GA
	* Gun alignment set: GA X15 Y-20
	* Gun alignment (set only, does not get?): GAA X12 Y-30
	* OL aperture get: OLAP
	* OL aperture set: OLAP 1..4
	* Magnification get: MG
	* Magnification set: MG 20000
	* INST mag get: INST
	* INST mag set: INST ON/OFF/REV

Probe Current
	* Probe Coarse get: CC
	* Probe Coarse set: CC 1..10
	* Probe Fine(!) get: CF
	* Probe Fine(!) set: CF 0..255

Emission Controls
	* get current value (eg. 8.0): EMIS
	* get emission mode: AEC
	* set auto emission off: AEC OFF
	* set auto emission to Reset: AEC RST
	* set auto emission to constant: AEC CNST
	* plot emission current (8 iterations/second for 30 seconds): EMM I8 T30

Focus
	* Wobbler: WBL ON/OFF
	* OL Coarse get: OC
	* OL Coarse set: OC 0..255
	* OL Fine get: OF
	* OL Fine set: OF 0..1023
	* WD get: WD
	* WD set (also sets OL coarse): WD 1..25
	* Lower SEI focus get: LMF
	* Lower SEI focus set: LMF 1..4096
	* Autofocus: AFD ON
	* Autostig: AST ON
	* Autofocus+Autostig: CMB ON
	* Dynamic focus get: DN
	* Dynamic focus set: DN ON/OFF/REV
	* Dynamic focus amplitude get: DA
	* Dynamic focus amplitude set: DA -128..127

Stigmatism Adjust
	* OL get: ST
	* OL set: ST X123 Y-5 -512..511
	* CL get: STC
	* CL set: STC X100 Y72

	Note that the stigmatism centering controls are analog and don't seem to allow programmatic adjustment.

Contrast/Brightness
	* Auto: ACB ON/OFF/REV/MEM
	* contrast get: SC
	* contrast set: SC 0..255
	* brightness get: SB
	* brightness set: SB 0..255

Display Functions
	* EOS menu: EOS
	* FIS menu: FIS
	* Memory: MEMO
	* Menus on CRT #1 (a.k.a. direct magnification FIS): DFIS ON/OFF
	* CRT #2 iterations: MONI 
		> Default is 64 samples: MONI I64
		> More samples (better but slower): MONI I1024
		> Fewer samples (faster but noisy): MONI I3
	* Custom message, CRT #1: FLL
	* Custom message, CRT #2: FLR

Imaging
	* Current imaging mode: EM 
		> Set upper SEI: EM SHR
		> Set lower SEI: EM SLM
		> Set alignment pattern: EM ALP
	* Image shift get: IS
	* Image shift set: IS X127 Y102 (-128..127)
	* Freeze frame: FREZ ON/OFF/REV
	* Integrate, then freeze: INTG
	* Average, then freeze: AVE
	* Show frame buffer: FM
	* YZ Modulation: YZM ON/OFF/REV
	* D-MAG (digital magnification?): DMG ON/OFF

Sensors
	* Image Selector: IMS1
		> IMS1 SEI/COM/AUX/TOP/OFF
		> Can be combined, eg. IMS1 SEI COM
		> Can't seem to set SEIL, but it can be selected from the EOS menu (be sure to turn on LOWER DETECTOR DEVICE switch on console right of CRT #2)
		> Use EM SLM to select lower SEI.
	* Compo brightness: CB
	* Topo brightness: TB
	* IMS input type: IA1 ANA/DIG
	* Collector: CLT ON/OFF/SUP 
		> Leave ON for normal imaging.
		> SUP applies a negative voltage
	* Photo Multiplier Tube link: PMT ON/OFF 
		> Leave ON for normal imaging. Turn OFF if contrast is too dim (uncoated biological samples at low accel voltages).
	* Probe Current Detector: PCD ON/OFF

Scan Modes
	* get current: SM
	* imaging: SM PIC
	* PIC reduce 2: SM RD2
	* PIC reduce 4: SM RD4
	* PIC reduce selected: SM RDC 
		> Set position X/Y: SP X4 Y108 (-128/127)
		> Set width X/Y: SW X12 Y100 (26..255)
	* Horizontal line: SM LSP
	* Bull's eye (for alignment): SM BUP
	* Spot mode: SM SPT
	* Video sync: VIDO ON/OFF 
		> Note: if VIDO is OFF, the NTSC frame grabber on the PC will not be able to sync.

Scan Rates
	* get: SS
	* set: SS [mode]
		> set FAST: SS TV
		> set 2x FAST: SS SR
		> set SLOW: SS S1..S3
		> set PHOTO: SS P1..P5
	* Single-shot slow scan: SLOW
	* Photo speed get: PS
	* Photo speed select: PS P1..5
	* Photo of Left CRT: PHL ON/OFF/REV
	* Photo of Right CRT: PHR ON/OFF/REV
	* Multiframe Photo of Left CRT: PML ON 2..65535

Memory functions
	* Memory description 1-10: MTL
	* Memory CC 1-10: MCC
	* Memory CF 1-10: MCF
	* Memory GA 1-10: MGA
	* Memory MG 1-10: MMG
	* Memory NM 1-10: MNM
	* Memory OC 1-10: MOC
	* Memory OF 1-10: MOF
	* Memory SB 1-10: MSB
	* Memory SC 1-10: MSC
	* Memory ST 1-10: MST

Remap PF1-PF10
	To remap, just type eg. PF1 [ANY COMMAND]. The default mappings are:

	* PF1 (basic display): PNU2
	* PF2 (Electron Optical System menu): EOS
	* PF3 (image processing): FIS
	* PF4 (Autofocus + Auto contrast/brightness): AUTO
	* PF5 (memory contents): MEMO
	* PF6 (Split screen frame buffer): DUAL
	* PF7 (Quad screen frame buffer): QUAD
	* PF8 (Degauss): LC ALL
	* PF9 (Autofocus, Autostig, Auto contrast/brightness): AFT,ASTG,ACB
	* PF10: MONI I64

Miscellaneous weirdness
	* Flash warning message: FEM ON/OFF
	* SEI Detector: SD OFF/SEI/REF 
		> Should always be SEI. Not sure why you'd turn it off, and we have no reference detector.
	* Degauss lenses: LC OL/CL/ALL
	* Greybar test: TEST
	* Greyscale Look Up Table editor: LUT
	* Waveform mode: WFM ON/OFF/REV
	* Brightness histogram: HIST
	* Scale: SCL 
		> Select X, Y, or R. No idea how to cancel.
	* CRT #2 annotation mode: PNU2 TEXT 
		> (no idea how to actually enter annotations)
		> To get it back to normal: hit BREAK or PNU2 STATS
	* In bytes (from where? Not the same as RD??): IN 00000
	* Out bytes (to where?): OUT ...
	* Read an arbitrary memory location: RD 00000
	* Write an arbitrary memory location (DANGEROUS!): WR 7F879 A1
		> You can temporarily set the acceleration voltage higher than 30kV by writing values to that memory location. This is used for DC conditioning only. DO NOT USE IT FOR IMAGING AS IT CAN DAMAGE THE SEM! Possible values are: 
	* A1: 32kV
	* A6: 33kV
	* AB: 34kV
	* B0: 35kV
	* B6: 36kV
	* C0: 38kV
	* C9: 40kV

Unknown commands
	* HIA (!4)

New untested commands
	Try <LF>CMD<CR>!
	Some long-running commands exit immediately with !0, followed by eg. !0 PHT0.

	* Set standard operating conditions: STD EOS/TBL/MEMO
	* DUAL EXE, DUAL R1/4 L2/4
	* AFD ON/OFF/FIN/COS/REV (fine AFD? sweet.)
	* IMX1 XR1/XR2/XR3/EDS
	* IMX2
	* IP1 (input polarity) NOR/INV/REV
	* IP2 (input polarity) NOR/INV/REV
	* IX (mix) ON/OFF/REV
	* EM ECP/EMP/PSC
	* GT (gun tilt)
	* IB1 (IMS 1 brightness) 0..255
	* IB2
	* IG1 (IMS gain) 0..255
	* IG2
	* ACCS (turn on/off accel voltage!) ON/OFF 
	* SWXY (increase/decrease scan width) U10/D10 (1..255) 
	* EC (ECP center?) EC X123 Y-123 (-128..127)
	* GB (gun bias) 0..9
	* GS (gun shift) GS X127 Y-128
	* EDIT F1 S2 01
	* ACBB (auto brightness value)
	* ACBL (auto brightness voltage level)
	* ACBC (auto contrast voltage level)
	* IMGV (write inst mag value)
	* AVE I3..2000 TV/SR 1..4 (multifilter at rate to buffer)
	* COPY F1..4 (copy current to frame buffer)
	* DATE 99.99.99 (set current date!)
	* DFLT AVE/INTG/SLOW/FM (read default arguments)
 
 
 
